In [4]:
df_left_hr = DataFrame({'key1':['sf','sf','sf','la','la'],'key2':[10,20,30,20,30], 'data_set': np.arange(5)})

In [2]:
import numpy as np
import pandas as pd
from  pandas import DataFrame, Series

In [5]:
df_right_hr = DataFrame(np.arange(10).reshape(5,2), 
                        index = [['la','la','sf','sf','sf'],[20,10,10,10,20]], 
                        columns = ['col_1', 'col_2'])

In [6]:
df_left_hr

  key1  key2  data_set
0   sf    10         0
1   sf    20         1
2   sf    30         2
3   la    20         3
4   la    30         4

In [7]:
df_right_hr

       col_1  col_2
la 20      0      1
   10      2      3
sf 10      4      5
   10      6      7
   20      8      9

In [14]:
pd.merge(df_left_hr,df_right_hr, left_on= ['key1','key2'], right_index= True)

  key1  key2  data_set  col_1  col_2
0   sf    10         0      4      5
0   sf    10         0      6      7
1   sf    20         1      8      9
3   la    20         3      0      1

In [16]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [17]:
np.concatenate([arr1,arr1],axis = 1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [18]:
np.concatenate([arr1,arr1],axis = 0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [19]:
ser1 = Series([0,1,2], index = ['t','u','v'])
ser2 = Series([3,4], index = ['x','y'])
ser1

t    0
u    1
v    2
dtype: int64

In [20]:
ser2

x    3
y    4
dtype: int64

In [21]:
pd.concat([ser1,ser2])

t    0
u    1
v    2
x    3
y    4
dtype: int64

In [22]:
pd.concat([ser1,ser2], axis = 1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1
t  0.0  NaN
u  1.0  NaN
v  2.0  NaN
x  NaN  3.0
y  NaN  4.0

In [24]:
pd.concat([ser1,ser2], keys = ['cat1','cat2'])

cat1  t    0
      u    1
      v    2
cat2  x    3
      y    4
dtype: int64

In [25]:
df1 = DataFrame(np.random.randn(4,3), columns = ['x','y','z'])
df2 = DataFrame(np.random.randn(3,3), columns=['y','q','x'])

In [26]:
df1

          x         y         z
0 -0.654752  0.183159  0.297046
1 -0.012040  0.273757  1.680031
2  1.712493 -0.421142 -1.648323
3  0.497183 -0.215190  0.638575

In [27]:
df2

          y         q         x
0 -1.334627 -0.360577 -1.926728
1 -1.098468 -1.457137 -0.721864
2 -0.721577  0.672466  1.046949

In [31]:
pd.concat([df1,df2])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          q         x         y         z
0       NaN -0.654752  0.183159  0.297046
1       NaN -0.012040  0.273757  1.680031
2       NaN  1.712493 -0.421142 -1.648323
3       NaN  0.497183 -0.215190  0.638575
0 -0.360577 -1.926728 -1.334627       NaN
1 -1.457137 -0.721864 -1.098468       NaN
2  0.672466  1.046949 -0.721577       NaN

In [30]:
sort = False

In [32]:
pd.concat([df1,df2], ignore_index = True)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          q         x         y         z
0       NaN -0.654752  0.183159  0.297046
1       NaN -0.012040  0.273757  1.680031
2       NaN  1.712493 -0.421142 -1.648323
3       NaN  0.497183 -0.215190  0.638575
4 -0.360577 -1.926728 -1.334627       NaN
5 -1.457137 -0.721864 -1.098468       NaN
6  0.672466  1.046949 -0.721577       NaN

In [34]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan], index = ['q','r','s','t','u','v'])
ser1

q    2.0
r    NaN
s    4.0
t    NaN
u    6.0
v    NaN
dtype: float64

In [37]:
ser2 = Series(np.arange(len(ser1)),dtype = np.float64, index = ['q','r','s','t','u','v'])
ser2

q    0.0
r    1.0
s    2.0
t    3.0
u    4.0
v    5.0
dtype: float64

In [38]:
Series(np.where(pd.isnull(ser1),ser2, ser1), index = ser1.index)

q    2.0
r    1.0
s    4.0
t    3.0
u    6.0
v    5.0
dtype: float64

In [39]:
ser1.combine_first(ser2)#short cut

q    2.0
r    1.0
s    4.0
t    3.0
u    6.0
v    5.0
dtype: float64

In [40]:
nan = np.nan

df_odd = DataFrame({'X':[1.,nan,3.,nan],
                    'Y':[nan,5.,nan,7.],
                   'Z':[nan,9., nan, 11.]})
df_even = DataFrame({'X':[2.,4.,nan,6.,8.],
                    'Y':[nan, 10.,12.,14.,16]})

In [41]:
df_odd

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [43]:
df_even

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [44]:
df_odd.combine_first(df_even)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN

In [73]:
df1 = DataFrame(np.arange(8).reshape(2,4), index = pd.Index(['la','sf'], name = 'city'), 
                columns = pd.Index(['A','B','C','D'], name = 'letter'))

In [51]:
df1

letter  A  B  C  D
city
la      0  1  2  3
sf      4  5  6  7

In [52]:
df_stk = df1.stack()

In [53]:
df_stk

city  letter
la    A         0
      B         1
      C         2
      D         3
sf    A         4
      B         5
      C         6
      D         7
dtype: int32

In [54]:
df_stk.unstack()

letter  A  B  C  D
city
la      0  1  2  3
sf      4  5  6  7

In [55]:
df_stk.unstack('letter')

letter  A  B  C  D
city
la      0  1  2  3
sf      4  5  6  7

In [56]:
df_stk.unstack('city')

city    la  sf
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [57]:
ser1 = Series([0,1,2],index = ['Q','X','Y'])
ser2 = Series([4,5,6], index = ['X','Y','Z'])
dframe = pd.concat([ser1,ser2], keys=['Alpha','Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [58]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [59]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [69]:
df1=dframe.unstack()

In [72]:
df = dframe.unstack().stack(dropna = False)
df

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [70]:
df1

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [68]:
type(dframe)

pandas.core.series.Series

In [71]:
type(df1)

pandas.core.frame.DataFrame

In [ ]:
dframe_piv = pivot_data.pivot('date','variable','value')

In [77]:
dframe_piv

NameError: name 'dframe_piv' is not defined

In [84]:
dframe = DataFrame({'key':['A']*2 + ['B']*3,
                   'key2':[2,2,2,3,3]})
dframe

  key  key2
0   A     2
1   A     2
2   B     2
3   B     3
4   B     3

In [79]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [80]:
dframe.drop_duplicates()

  key  key2
0   A     2
2   B     2
3   B     3

In [81]:
dframe.drop_duplicates('key')

  key  key2
0   A     2
2   B     2

In [82]:
dframe.drop_duplicates('key2')

  key  key2
0   A     2
3   B     3

In [87]:
dframe.drop_duplicates(['key'],keep = 'last')

  key  key2
1   A     2
4   B     3

In [89]:
dframe = DataFrame({'city':['alma','brain head','cox park'],
                   'altitude':[7678,8789,90810]})
dframe

         city  altitude
0        alma      7678
1  brain head      8789
2    cox park     90810

In [90]:
state_map = {'alma': 'colorado','brain head':'utah','cox park':'wyoming'}

In [91]:
state_map

{'alma': 'colorado', 'brain head': 'utah', 'cox park': 'wyoming'}

In [92]:
dframe['state']= dframe['city'].map(state_map)

In [93]:
dframe

         city  altitude     state
0        alma      7678  colorado
1  brain head      8789      utah
2    cox park     90810   wyoming

In [94]:
ser1 = Series([1,2,3,4,1,2,3,4])

In [95]:
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

In [96]:
ser1.replace(1,np.nan)#can pass like this

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [97]:
ser1.replace([1,4],[100,400])#can pass lists

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

In [99]:
ser1.replace({1:np.nan})#dicts

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

In [101]:
dframe = DataFrame(np.arange(12).reshape(3,4), index = ['NY','LA','SF'], columns = ['A','B','C','D'])
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [103]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [105]:
dframe.index = dframe.index.map(str.lower)

In [106]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [107]:
dframe.rename(index= str.title, columns = str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [108]:
dframe.rename(index = {'ny':'New York'},columns = {'A':'Alpha'})

          Alpha  B   C   D
New York      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [109]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [110]:
dframe.rename(index = {'ny':'New York'},columns = {'A':'Alpha'}, inplace = True)

In [111]:
dframe

          Alpha  B   C   D
New York      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [112]:
years = [1990,1991,1928,1998,1937,1989, 1972, 1955, 1964]

In [113]:
decade_bins = [1960,1990,1920,1930,1980,1950]

In [114]:
decade_cat = pd.cut(years,decade_bins)

ValueError: bins must increase monotonically.

In [125]:
decade_bins = [1920,1930,1940,1950,1960,1970,1980,1990]

In [126]:
decade_cat = pd.cut(years,decade_bins)

In [127]:
decade_cat

[(1980, 1990], NaN, (1920, 1930], NaN, (1930, 1940], (1980, 1990]]
Categories (7, interval[int64]): [(1920, 1930] < (1930, 1940] < (1940, 1950] < (1950, 1960] < (1960, 1970] < (1970, 1980] < (1980, 1990]]

In [128]:
decade_cat.categories

IntervalIndex([(1920, 1930], (1930, 1940], (1940, 1950], (1950, 1960], (1960, 1970], (1970, 1980], (1980, 1990]]
              closed='right',
              dtype='interval[int64]')

In [129]:
pd.value_counts(decade_cat)

(1980, 1990]    2
(1930, 1940]    1
(1920, 1930]    1
(1970, 1980]    0
(1960, 1970]    0
(1950, 1960]    0
(1940, 1950]    0
dtype: int64

In [130]:
pd.cut(years,2,precision = 1)

[(1963.0, 1998.0], (1963.0, 1998.0], (1927.9, 1963.0], (1963.0, 1998.0], (1927.9, 1963.0], (1963.0, 1998.0]]
Categories (2, interval[float64]): [(1927.9, 1963.0] < (1963.0, 1998.0]]

In [131]:
np.random.seed(12345)

In [132]:
dframe =DataFrame(np.random.randn(1000,4))

In [133]:
dframe.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [134]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [135]:
dframe.tail()

            0         1         2         3
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

In [137]:
col = dframe[0]

In [138]:
col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

In [140]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

In [143]:
dframe[(np.abs(dframe)>3).any(1)]# return any row that has any one column value greater than 3

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [144]:
dframe[np.abs(dframe)>3] = np.sign(dframe)*3

In [145]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [147]:
dframe = DataFrame(np.arange(16).reshape(4,4))

In [148]:
blender = np.random.permutation(4)

In [149]:
blender

array([1, 3, 2, 0])

In [150]:
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [151]:
dframe.take(blender)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [152]:
#permutation with replacement

In [153]:
box = np.array([1,2,3])

In [154]:
shaker = np.random.randint(0,len(box),size = 10)

In [155]:
shaker

array([2, 0, 2, 0, 2, 0, 2, 0, 2, 2])

In [156]:
hand_grabs = box.take(shaker)
hand_grabs

array([3, 1, 3, 1, 3, 1, 3, 1, 3, 3])

In [158]:
dframe = DataFrame({'k1':['x','x','y','y','z'],'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),'dataset2':np.random.randn(5)})

In [159]:
dframe

  k1     k2  dataset1  dataset2
0  x  alpha  0.779515  0.159703
1  x   beta -2.453088  0.101103
2  y  alpha  0.689468 -0.087746
3  y   beta  0.280517 -0.658604
4  z  alpha  1.622469  0.497419

In [160]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [161]:
group1

In [162]:
group1.mean()

k1
x   -0.836786
y    0.484992
z    1.622469
Name: dataset1, dtype: float64

In [163]:
cities = np.array(['ny','la','la','ny','ny'])
month = np.array(['jan','feb','jan','feb','jan'])

In [164]:
dframe['dataset1'].groupby([cities,month]).mean()

la  feb   -2.453088
    jan    0.689468
ny  feb    0.280517
    jan    1.200992
Name: dataset1, dtype: float64

In [165]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
x  -0.836786  0.130403
y   0.484992 -0.373175
z   1.622469  0.497419

In [166]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
x  alpha  0.779515  0.159703
   beta  -2.453088  0.101103
y  alpha  0.689468 -0.087746
   beta   0.280517 -0.658604
z  alpha  1.622469  0.497419

In [167]:
dframe.groupby(['k1']).size()

k1
x    2
y    2
z    1
dtype: int64

In [190]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name )
    print (group)
    print ('\n')

This is the x group
  k1     k2  dataset1  dataset2
0  x  alpha  0.779515  0.159703
1  x   beta -2.453088  0.101103


This is the y group
  k1     k2  dataset1  dataset2
2  y  alpha  0.689468 -0.087746
3  y   beta  0.280517 -0.658604


This is the z group
  k1     k2  dataset1  dataset2
4  z  alpha  1.622469  0.497419

In [191]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = x Key2 = alpha
  k1     k2  dataset1  dataset2
0  x  alpha  0.779515  0.159703


Key1 = x Key2 = beta
  k1    k2  dataset1  dataset2
1  x  beta -2.453088  0.101103


Key1 = y Key2 = alpha
  k1     k2  dataset1  dataset2
2  y  alpha  0.689468 -0.087746


Key1 = y Key2 = beta
  k1    k2  dataset1  dataset2
3  y  beta  0.280517 -0.658604


Key1 = z Key2 = alpha
  k1     k2  dataset1  dataset2
4  z  alpha  1.622469  0.497419

In [192]:
group_dict = dict(list(dframe.groupby('k1')))

In [193]:
group_dict

{'x':   k1     k2  dataset1  dataset2
 0  x  alpha  0.779515  0.159703
 1  x   beta -2.453088  0.101103, 'y':   k1     k2  dataset1  dataset2
 2  y  alpha  0.689468 -0.087746
 3  y   beta  0.280517 -0.658604, 'z':   k1     k2  dataset1  dataset2
 4  z  alpha  1.622469  0.497419}

In [194]:
group_dict['x']

  k1     k2  dataset1  dataset2
0  x  alpha  0.779515  0.159703
1  x   beta -2.453088  0.101103

In [195]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis =1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.779515  0.159703
 1 -2.453088  0.101103
 2  0.689468 -0.087746
 3  0.280517 -0.658604
 4  1.622469  0.497419, dtype('O'):   k1     k2
 0  x  alpha
 1  x   beta
 2  y  alpha
 3  y   beta
 4  z  alpha}

In [197]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [199]:
dataset2_group.mean()

          dataset2
k1 k2
x  alpha  0.159703
   beta   0.101103
y  alpha -0.087746
   beta  -0.658604
z  alpha  0.497419

In [200]:
animals = DataFrame(np.arange(16).reshape(4,4),columns = ['W','X','Y','Z'],index = ['Dog','Cat','Bird','MOuse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
MOuse  12  13  14  15

In [201]:
animals.ix[1:2,['W','Y']] = np.nan

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [202]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
MOuse  12.0  13  14.0  15

In [204]:
behaviour_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}
animal_col = animals.groupby(behaviour_map, axis = 1)
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   0.0
Bird   20.0  18.0
MOuse  28.0  26.0

In [205]:
behave_series = Series(behaviour_map)
behave_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [206]:
animals.groupby(behave_series,axis =1).count()

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
MOuse    2     2

In [207]:
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [208]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
MOuse  12.0  13  14.0  15

In [209]:
keys = ['A','B','A','B']
animals.groupby([len,keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15

In [210]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]], names = ['City','sub_value'])

In [211]:
hier_col

MultiIndex(levels=[['NY', 'SF'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1], [0, 1, 2, 0, 1]],
           names=['City', 'sub_value'])

In [214]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns = hier_col)

In [215]:
dframe_hr = dframe_hr *100

In [216]:
dframe_hr

City         NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400

In [217]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/'

In [220]:
dframe_wine = pd.read_csv('winequality-red.csv', sep = ';')

In [222]:
dframe_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [223]:
dframe_wine['alcohol'].mean()

10.422983114446502

In [224]:
def max_to_min(arr):
    return arr.max() - arr.min()

In [225]:
wino = dframe_wine.groupby('quality')

In [226]:
wino.describe()

        alcohol                                                          \
          count       mean       std  min     25%     50%     75%   max
quality
3          10.0   9.955000  0.818009  8.4   9.725   9.925  10.575  11.0
4          53.0  10.265094  0.934776  9.0   9.600  10.000  11.000  13.1
5         681.0   9.899706  0.736521  8.5   9.400   9.700  10.200  14.9
6         638.0  10.629519  1.049639  8.4   9.800  10.500  11.300  14.0
7         199.0  11.465913  0.961933  9.2  10.800  11.500  12.100  14.0
8          18.0  12.094444  1.224011  9.8  11.325  12.150  12.875  14.0

        chlorides            ...   total sulfur dioxide         \
            count      mean  ...                    75%    max
quality                      ...
3            10.0  0.122500  ...                   42.5   49.0
4            53.0  0.090679  ...                   49.0  119.0
5           681.0  0.092736  ...                   84.0  155.0
6           638.0  0.084956  ...                   54.0  165.0
7           199.0  0.076588  ...                   43.0  289.0
8            18.0  0.068444  ...                   43.0   88.0

        volatile acidity                                                   \
                   count      mean       std   min     25%    50%     75%
quality
3                   10.0  0.884500  0.331256  0.44  0.6475  0.845  1.0100
4                   53.0  0.693962  0.220110  0.23  0.5300  0.670  0.8700
5                  681.0  0.577041  0.164801  0.18  0.4600  0.580  0.6700
6                  638.0  0.497484  0.160962  0.16  0.3800  0.490  0.6000
7                  199.0  0.403920  0.145224  0.12  0.3000  0.370  0.4850
8                   18.0  0.423333  0.144914  0.26  0.3350  0.370  0.4725


           max
quality
3        1.580
4        1.130
5        1.330
6        1.040
7        0.915
8        0.850

[6 rows x 88 columns]

In [227]:
wino.agg(max_to_min)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol
quality,,,,,,,,,,,
3,4.9,1.140,0.66,4.5,0.206,31.0,40.0,0.00609,0.47,0.46,2.6
4,7.9,0.900,1.00,11.6,0.565,38.0,112.0,0.00760,1.16,1.67,4.1
5,10.9,1.150,0.79,14.3,0.572,65.0,149.0,0.01059,0.86,1.61,6.4
6,9.6,0.880,0.78,14.5,0.381,71.0,159.0,0.01362,1.15,1.55,5.6
7,10.7,0.795,0.76,7.7,0.346,51.0,282.0,0.01256,0.86,0.97,4.8
8,7.6,0.590,0.69,5.0,0.042,39.0,76.0,0.00800,0.84,0.47,4.2

In [229]:
wino.agg('mean')

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol
quality,,,,,,,,,,,
3,8.360000,0.884500,0.171000,2.635000,0.122500,11.000000,24.900000,0.997464,3.398000,0.570000,9.955000
4,7.779245,0.693962,0.174151,2.694340,0.090679,12.264151,36.245283,0.996542,3.381509,0.596415,10.265094
5,8.167254,0.577041,0.243686,2.528855,0.092736,16.983847,56.513950,0.997104,3.304949,0.620969,9.899706
6,8.347179,0.497484,0.273824,2.477194,0.084956,15.711599,40.869906,0.996615,3.318072,0.675329,10.629519
7,8.872362,0.403920,0.375176,2.720603,0.076588,14.045226,35.020101,0.996104,3.290754,0.741256,11.465913
8,8.566667,0.423333,0.391111,2.577778,0.068444,13.277778,33.444444,0.995212,3.267222,0.767778,12.094444

In [230]:
dframe_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [231]:
dframe_wine['qual/alc ratio'] = dframe_wine['quality']/dframe_wine['alcohol']

In [232]:
dframe_wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,qual/alc ratio
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5,0.531915
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5,0.510204
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5,0.510204
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6,0.612245
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5,0.531915

In [233]:
dframe_wine.pivot_table(index = ['quality'])

,alcohol,chlorides,citric acid,density,fixed acidity,free sulfur dioxide,pH,qual/alc ratio,residual sugar,sulphates,total sulfur dioxide,volatile acidity
quality,,,,,,,,,,,,
3,9.955000,0.122500,0.171000,0.997464,8.360000,11.000000,3.398000,0.303286,2.635000,0.570000,24.900000,0.884500
4,10.265094,0.090679,0.174151,0.996542,7.779245,12.264151,3.381509,0.392724,2.694340,0.596415,36.245283,0.693962
5,9.899706,0.092736,0.243686,0.997104,8.167254,16.983847,3.304949,0.507573,2.528855,0.620969,56.513950,0.577041
6,10.629519,0.084956,0.273824,0.996615,8.347179,15.711599,3.318072,0.569801,2.477194,0.675329,40.869906,0.497484
7,11.465913,0.076588,0.375176,0.996104,8.872362,14.045226,3.290754,0.614855,2.720603,0.741256,35.020101,0.403920
8,12.094444,0.068444,0.391111,0.995212,8.566667,13.277778,3.267222,0.668146,2.577778,0.767778,33.444444,0.423333

In [235]:
dframe_wine['residual sugar'].mean()

2.5388055034396517

In [236]:
def ranker(df):
    df['alc_content_rank'] = np.arange(len(df)) + 1
    return df

In [245]:
dframe_wine.sort_values('alcohol', ascending = False, inplace = True) 
# dframe_wine will hold sorted values due to inplace = true

In [239]:
dframe_wine = dframe_wine.groupby('quality').apply(ranker)

In [243]:
dframe_wine.head(15)

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,qual/alc ratio,alc_content_rank
652,15.9,0.36,0.65,7.5,0.096,22.0,71.0,0.99760,2.98,0.84,14.900000,5,0.335570,1
588,5.0,0.42,0.24,2.0,0.060,19.0,50.0,0.99170,3.72,0.74,14.000000,8,0.571429,1
142,5.2,0.34,0.00,1.8,0.050,27.0,63.0,0.99160,3.68,0.79,14.000000,6,0.428571,1
144,5.2,0.34,0.00,1.8,0.050,27.0,63.0,0.99160,3.68,0.79,14.000000,6,0.428571,2
1270,5.0,0.38,0.01,1.6,0.048,26.0,60.0,0.99084,3.70,0.75,14.000000,6,0.428571,3
1269,5.5,0.49,0.03,1.8,0.044,28.0,87.0,0.99080,3.50,0.82,14.000000,8,0.571429,2
467,8.8,0.46,0.45,2.6,0.065,7.0,18.0,0.99470,3.32,0.79,14.000000,6,0.428571,4
821,4.9,0.42,0.00,2.1,0.048,16.0,42.0,0.99154,3.71,0.74,14.000000,7,0.500000,1
1114,5.0,0.40,0.50,4.3,0.046,29.0,80.0,0.99020,3.49,0.66,13.600000,6,0.441176,5
1228,5.1,0.42,0.00,1.8,0.044,18.0,88.0,0.99157,3.68,0.73,13.600000,7,0.514706,2
1132,7.4,0.36,0.34,1.8,0.075,18.0,38.0,0.99330,3.38,0.88,13.600000,7,0.514706,3
1477,5.3,0.47,0.11,2.2,0.048,16.0,89.0,0.99182,3.54,0.88,13.600000,7,0.514706,4
1475,5.3,0.47,0.11,2.2,0.048,16.0,89.0,0.99182,3.54,0.88,13.566667,7,0.515971,5
1126,5.8,0.29,0.26,1.7,0.063,3.0,11.0,0.99150,3.39,0.54,13.500000,6,0.444444,6
492,8.9,0.40,0.51,2.6,0.052,13.0,27.0,0.99500,3.32,0.90,13.400000,7,0.522388,6

In [246]:
num_of_qual = dframe_wine['quality'].value_counts()

In [247]:
num_of_qual

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [251]:
dframe_wine[dframe_wine.alc_content_rank ==1].head(len(num_of_qual))

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality,qual/alc ratio,alc_content_rank
652,15.9,0.36,0.65,7.5,0.096,22.0,71.0,0.99760,2.98,0.84,14.9,5,0.335570,1
588,5.0,0.42,0.24,2.0,0.060,19.0,50.0,0.99170,3.72,0.74,14.0,8,0.571429,1
142,5.2,0.34,0.00,1.8,0.050,27.0,63.0,0.99160,3.68,0.79,14.0,6,0.428571,1
821,4.9,0.42,0.00,2.1,0.048,16.0,42.0,0.99154,3.71,0.74,14.0,7,0.500000,1
45,4.6,0.52,0.15,2.1,0.054,8.0,65.0,0.99340,3.90,0.56,13.1,4,0.305344,1
899,8.3,1.02,0.02,3.4,0.084,6.0,11.0,0.99892,3.48,0.49,11.0,3,0.272727,1

In [258]:
try:
    from StringIO import StringIO
except:
    from io import StringIO

In [254]:
!pip install StringIO

Collecting StringIO

  Could not find a version that satisfies the requirement StringIO (from versions: )
No matching distribution found for StringIO

In [257]:
#The StringIO and cStringIO modules are gone. Instead, import the io module and use io.StringIO or io.BytesIO for text and data respectively.

In [263]:
data = """\
Sample Animal Intelligence
1 Dog Smart
2 Dog Smart
3 Cat Dumb
4 Cat Dumb
5 Dog Dumb
6 Cat Smart"""

In [264]:
dframe = pd.read_table(StringIO(data),sep = '\s+')

In [265]:
dframe

   Sample Animal Intelligence
0       1    Dog        Smart
1       2    Dog        Smart
2       3    Cat         Dumb
3       4    Cat         Dumb
4       5    Dog         Dumb
5       6    Cat        Smart

In [266]:
pd.crosstab(dframe.Animal,dframe.Intelligence,margins = True)

Intelligence  Dumb  Smart  All
Animal
Cat              2      1    3
Dog              1      2    3
All              3      3    6

In [267]:
#free datasets repo

#www.data.gov
#aws.amazon.com/public-data-sets/
#www.google.com/publicdata/directory